//банда четырех GoF - 23 паттерна проектирования
/*
код понятнее 
сокращение связанности
легче сопровождать и тестировать
переиспользование
расширяемость, модифицируемость
*/

//порождающие - создание объектов
/*
используется:
указатели, фабричные функции, делегирование создания, шаблоны
*/

//структурные - структурирование кода - композиция классов и объектов
/*
используется:
наследование, шаблоны, интерфейсы
*/

//поведенческие - работа с объектами, их взаимодействия и управление ими

/*
solid (srp) - принцип единственной ответственности
solid, dry (open/closed) - открыт для расширения, закрыт для модификации


инкапсуляция
композиция

*/